# visit_a_doctor/specialties_mapping.py
"""
Справочник сокращенных названий МО.
"""

Abbreviations_MO = {
    # MO_Name -> ShortName, Address (or just ShortName if explicit)
    "Поликлиника г. Инкерман, ГБУЗ С \"Городская больница №9\"": "Поликлиника Инкерман, ул. Умрихина, 16",
    "Стоматологическое отделение № 1, ГБУЗС \"Стомполиклиника №1\"": "Стомат. отд. №1, ул. Бутакова, 40",
    "Поликлиника №1, ГБУЗ С \"Городская больница №1\"": "Поликлиника №1, ул. Адм. Октябрьского, 19",
    "Отделение ортопедической стоматологии Стоматологического отделения № 1, ГБУЗС \"Стомполиклиника №1\"": "Ортопед. стомат. №1, ул. Бутакова, 40",
    "Центр охраны здоровья семьи и репродукции с консультативным отделением для беременных, ГБУЗ С \"Горбольница № 5 - \"ЦОЗМИР\"": "ЦОЗМИР, пр-кт Гагарина, 17В",
    "Филиал 1 Поликлиника №4, ГБУЗ С \"Городская больница №1\"": "Филиал 1 Поликл. №4, ул. Силаева, 3",
    "Центр управления сердечно-сосудистыми рисками, ГБУЗ С \"Городская больница №1\"": "ЦУССР, ул. Адм. Октябрьского, 19",
    "Амбулатория общей практики семейной медицины, ГБУЗ С \"Городская больница №1\"": "Амбулатория ОПСМ, ул. Шевченко, 3",
    "Сельская врачебная амбулатория с. Орлиное, ГБУЗ С \"Городская больница №9\"": "СВА с. Орлиное, ул. Тюкова, 115",
    "Отделение терапевтической и хирургической стоматологии Стоматологического отделения № 2, ГБУЗС \"Стомполиклиника №1\"": "Тер. и хир. стомат. №2, ул. Надеждинцев, 20",
    "Поликлиника №2, ГБУЗ С \"Городская больница №1\"": "Поликлиника №2, ул. Ерошенко, 11",
    "Поликлиника №3, ГБУЗ С \"Городская больница №1\"": "Поликлиника №3, ул. Б. Михайлова, 4",
    "Врачебная амбулатория, ГБУЗ С \"Городская больница №1\"": "Врачебная амбулатория, ш. Фиолентовское",
    "Женская консультация №1, ГБУЗ С \"Городская больница №1\"": "ЖК №1, ул. Правды, 6",
    "Женская консультация №3, ГБУЗ С \"Городская больница №1\"": "ЖК №3, пл. Геннериха, 1",
    "Отделение ортопедической стоматологии Стоматологического отделения № 2, ГБУЗС \"Стомполиклиника №1\"": "Ортопед. стомат. №2, ул. Надеждинцев, 20",
    "Отделение хирургической стоматологии Стоматологического отделения № 1, ГБУЗС \"Стомполиклиника №1\"": "Хирург. стомат. №1, ул. Бутакова, 40",
    "Поликлиника №6, ГБУЗ С \"Городская больница №1\"": "Поликлиника №6, б. Казачья, 10В",
    "Поликлиника для взрослого населения, ГБУЗ С «Городская больница №4»": "Поликлиника для взрослых, ул. Леваневского, 25",
    "Отделение терапевтической стоматологии Стоматологического отделения № 1, ГБУЗС \"Стомполиклиника №1\"": "Терапевт. стомат. №1, ул. Бутакова, 40",
    "Больница имени Даши Севастопольской Филиал 2 Поликлиника №5, ГБУЗ С \"Городская больница №1\"": "Поликлиника №5, пл. Геннериха, 1",
    "Детская поликлиника №1, ГБУЗ С \"Городская больница №5 - \"Центр охраны здоровья матери и ребенка\"": "Детская поликлиника №1, ул. Ленина, 20"
}
